select concat_ws(
         ' — ', 
         subq.department, 
         subq.ward
       ) as "full ward name"
  from (select d.name as department,
               w.name as ward
          from departments as d
          join wards as w
            on d.id = dep_id) as subq;

-- +----------------------------------------------+
-- |                full ward name                |
-- +----------------------------------------------+
-- | Отделение общей терапии — ООТ-1              |
-- | Отделение общей терапии — ООТ-2              |
-- | Отделение общей терапии — ООТ-3              |
-- | Отделение общей терапии — ООТ-4              |
-- | Неврологическое отделение — НО-1             |
-- ................................................
-- | Токсикологическое отделение — ТО-2           |
-- | Токсикологическое отделение — ТО-3           |
-- | Токсикологическое отделение — ТО-4           |
-- | Физиотерапевтическое отделение — ФО-1        |
-- | Физиотерапевтическое отделение — ФО-2        |
-- +----------------------------------------------+
-- (18 строк)


select 
  case 
    when subq."специальность" is not null
      then subq."специальность"
    else
      'Младший медицинский персонал'
  end as "специальность",
  string_agg(subq."фамилия", ', ') as "врачи"
from (
  select
    s.name as "специальность",
    last_name as "фамилия"
  from
    specializations as s
  full join
    doctors_specs as ds 
    on s.id = spec_id
  full join
    doctors as d
    on doctor_id = d.id
  order by
    "специальность",
    "фамилия"
) as subq
group by
  subq."специальность"

-- +------------------------------+---------------------------------------------------------------------+
-- |        специальность         |                                врачи                                |
-- +------------------------------+---------------------------------------------------------------------+
-- | Анестезиолог                 | Грамарь, Еремеев, Кокко, Фиалкин                                    |
-- | Гастроэнтеролог              | Еремеев, Толмачёв                                                   |
-- | Дерматолог                   | Кокко, Мамина                                                       |
-- | Диетолог                     | Колосов, Нежинский, Садовский, Фиалкин                              |
-- | Иммунолог                    |                                                                     |
-- | Кардиолог                    | Благая, Васильков, Еремеев, Садовский, ФОнвизина                    |
-- ......................................................................................................
-- | Эндокринолог                 | Варламова                                                           |
-- | Младший медицинский персонал | Адамов, Алексеев, Беркутова, Введенская, Востоков, Даль, Духовская, |
-- |                                Ежевская, Жемчужина, Кирсанова, Кирсанова, Кольцова, Крымова,       |
-- |                                Куликовский, Лазарев, Лескова, Назарова, Никитин, Островский,       |
-- |                                Полянская, Родочинский, Суздальская, Талисманова, Тарасова,         |
-- |                                Тинькофф, Тинькофф, Тихонова, Харитонов, Язовская, Янушевская       |
-- +------------------------------+---------------------------------------------------------------------+
-- (21 строка)


select
  subq1."total donations" as "total donations",
  subq1."year" as "year",
  subq2."total vacations" as "total vacations"
from (
  select 
    date_part('year', date) as "year", 
    sum(amount) as "total donations"
  from 
    donations 
  group by 
    "year" 
  order by "year"
) as subq1
full join (
  select 
    date_part('year', start_date) as "year", 
    count(*) as "total vacations" 
  from 
    vacations 
  group by 
    "year" 
  order by 
    "year"
) as subq2
  on subq1."year" = subq2."year";

-- +-----------------+------+-----------------+
-- | total donations | year | total vacations |
-- +-----------------+------+-----------------+
-- |      1720963.40 | 2014 |                 |
-- |      1639466.07 | 2015 |                 |
-- |      1879620.87 | 2016 |                 |
-- |      2314903.82 | 2017 |              33 |
-- |      1118190.81 | 2018 |              32 |
-- |      2170273.78 | 2019 |              25 |
-- |      3646402.67 | 2020 |              32 |
-- |       446287.76 | 2021 |              25 |
-- |      1028449.01 | 2022 |              35 |
-- |      1005931.20 | 2023 |              36 |
-- |      1238227.49 | 2024 |              29 |
-- +-----------------+------+-----------------+
-- (11 строк)


select 
  last_name,
  salary + premium as income
from 
  doctors
where
  salary + premium < (select avg(salary + premium) from doctors);

-- +-------------+----------+
-- |  last_name  |  income  |
-- +-------------+----------+
-- | Талисманова | 67318.82 |
-- | Еремеев     | 60610.35 |
-- | Мамина      | 68040.38 |
-- | Селиверстов | 51578.79 |
-- | Кольцова    | 59525.55 |
-- ..........................
-- | Скворцов    | 76572.44 |
-- | Северянин   | 55990.98 |
-- | Полянская   | 62508.24 |
-- | Подольская  | 48154.52 |
-- | Лазарев     | 73372.84 |
-- +-------------+----------+
-- (34 строки)

