   select date,
          dep.name as department,
          s.name as sponsor,
          amount
     from departments as dep
full join donations as don
       on dep.id = dep_id 
full join sponsors as s
       on sponsor_id = s.id
 order by date

-- +------------+--------------------------------------+-----------------------------+-----------+
-- |    date    |              department              |           sponsor           |  amount   |
-- +------------+--------------------------------------+-----------------------------+-----------+
-- | 2014-01-01 | Кардиологическое отделение           | ДоброДомик                  | 389568.85 |
-- | 2014-03-27 | Отделение функциональной диагностики | Жизненный путь              | 716246.08 |
-- | 2014-08-31 | Реанимация и интенсивная терапия     | Защити жизнь                | 615148.47 |
-- | 2015-02-01 | Отделение функциональной диагностики | Близко к сердцу             | 177474.17 |
-- | 2015-03-24 | Отделение общей терапии              | Преодолей-ка                |  30720.58 |
-- ...............................................................................................
-- | 2024-05-21 | Кардиологическое отделение           | Апельсин                    | 164151.49 |
-- | 2024-05-29 | Отделение функциональной диагностики | Детский паллиатив           | 311060.10 |
-- | 2024-10-27 | Отделение общей терапии              | Перспективы                 | 123037.85 |
-- | 2024-11-10 | Токсикологическое отделение          | Перспективы                 | 510029.91 |
-- |            |                                      | София                       |           |
-- +------------+--------------------------------------+-----------------------------+-----------+
-- (49 строк)

