   select d.id,
          concat_ws(' ', last_name, first_name, patr_name) as "fio",
          v.id
     from doctors as d
left join vacations as v
       on doctor_id = d.id
 order by d.id;
-- +----+-----------------------------------+-----+
-- | id |                fio                | id  |
-- +----+-----------------------------------+-----+
-- |  1 | Ежевская Соломония Варсонофиевна  | 238 |
-- |  1 | Ежевская Соломония Варсонофиевна  |  20 |
-- |  2 | Талисманова Ольга Валериановна    | 236 |
-- |  2 | Талисманова Ольга Валериановна    |  61 |
-- |  2 | Талисманова Ольга Валериановна    | 163 |
-- ................................................
-- | 69 | Гаранин Назар Исаевич             |  71 |
-- | 69 | Гаранин Назар Исаевич             | 113 |
-- | 69 | Гаранин Назар Исаевич             | 179 |
-- | 69 | Гаранин Назар Исаевич             | 177 |
-- | 70 | Толмачёв Викентий Григорьевич     |     |
-- +----+-----------------------------------+-----+
-- (250 строк)


  select concat_ws(
           ' ', 
           last_name, 
           first_name, 
           patr_name
         ) as "fio",
         name as "spec"
    from specializations as s
    join doctors_specs as ds
      on s.id = spec_id
    join doctors as d
      on doctor_id = d.id
order by "fio";
-- +-----------------------------------+-------------------+
-- |                fio                |       spec        |
-- +-----------------------------------+-------------------+
-- | Архипов Мелетий Болеславович      | Реаниматолог      |
-- | Бельская Руфина Евгениевна        | Терапевт          |
-- | Благая Агнеса Карповна            | Кардиолог         |
-- | Варламова Хесса Филатовна         | Ревматолог        |
-- | Варламова Хесса Филатовна         | Эндокринолог      |
-- .........................................................
-- | Цесарская Аделия Ксенофонтовна    | Терапевт          |
-- | Шадрина Ефимия Мокиевна           | Хирург            |
-- | Элинская Нашида Егориевна         | Уролог            |
-- | Элинская Нашида Егориевна         | Оториноларинголог |
-- | Яволовская Лукреция Христофоровна | Ревматолог        |
-- +-----------------------------------+-------------------+
-- (55 строк)


   select last_name,
          spec_id
     from doctors as d
left join doctors_specs as ds
       on d.id = doctor_id;
-- +-------------+---------+
-- |  last_name  | spec_id |
-- +-------------+---------+
-- | Фиалкин     |       5 |
-- | Кожевников  |      10 |
-- | Дольский    |      14 |
-- | Селиверстов |      10 |
-- | Искрин      |       8 |
-- .........................
-- | Даль        |         |
-- | Кирсанова   |         |
-- | Харитонов   |         |
-- | Суздальская |         |
-- | Кольцова    |         |
-- +-------------+---------+
-- (85 строк)


   select round(avg(salary + premium), -2) as "nursery average income"
     from doctors as d
left join doctors_specs as ds
       on d.id = doctor_id
    where spec_id is null;
-- +------------------------+
-- | nursery average income |
-- +------------------------+
-- |                  78900 |
-- +------------------------+
-- (1 строка)

