delete from books_publishers;
delete from publishers;
delete from books;
delete from authors;

insert into authors
  (id, first_name, last_name)
values
  (1, "Лев", "Толстой"),
  (2, "Фёдор", "Достоевский"),
  (3, "Рэй", "Брэдбери"),
  (4, "Лоис", "Буджолд"),
  (5, "Мария", "Семёнова"),
  (6, "Николай", "Гоголь"),
  (7, "Александр", "Пушкин"),
  (8, "Эрих", "Ремарк"),
  (9, "Уильям", "Шекспир"),
  (10, "Гомер", "");

insert into books
  (id, title, author_id)
values
  (1, "Капитанская дочка", 7),
  (2, "Пиковая дама", 7),
  (3, "Элетрическо тело, пою!", 3),
  (4, "Двухсолетний человек", 3),
  (5, "Бесы", 2),
  (6, "Преступление и наказание", 2),
  (7, "На западном фронте без перемен", 8),
  (8, "Истовик-камень", 5),
  (9, "Волкодав", 5),
  (10, "Война и мир", 1),
  (11, "Барраяр", 4),
  (12, "Осколки чести", 4),
  (13, "Игры форов", 4),
  (14, "Иллиада", 10),
  (15, "Одиссея", 10),
  (16, "Вечера на хуторе близ Диканьки", 6),
  (17, "Ревизор", 6);

insert into publishers
values
  (1, "АСТ"),
  (2, "Эксмо"),
  (3, "Лира");

insert into books_publishers
values
  ("9785899346192", 3, 1),
  ("9785806716112", 4, 1),
  ("9785899346432", 11, 2),
  ("9785496953462", 12, 2),
  ("9785899344912", 13, 2),
  ("9785806712622", 1, 3),
  ("9785496956072", 16, 1),
  ("9785496955172", 2, 3),
  ("9785899344402", 6, 3),
  ("9785899344582", 8, 2),
  ("9785806712122", 17, 1),
  ("9785806716712", 9, 2);

