select * from books;

-- +----+-----------+--------------------------------+
-- | id | author_id | title                          |
-- +----+-----------+--------------------------------+
-- |  1 |         7 | Капитанская дочка              |
-- |  2 |         7 | Пиковая дама                   |
-- |  3 |         3 | Элетрическо тело, пою!         |
-- ...................................................
-- | 15 |        10 | Одиссея                        |
-- | 16 |         6 | Вечера на хуторе близ Диканьки |
-- | 17 |         6 | Ревизор                        |
-- +----+-----------+--------------------------------+
-- 17 rows in set (0.0058 sec)


select title from books;

-- +--------------------------------+
-- | title                          |
-- +--------------------------------+
-- | Капитанская дочка              |
-- | Пиковая дама                   |
-- | Элетрическо тело, пою!         |
-- ..................................
-- | Одиссея                        |
-- | Вечера на хуторе близ Диканьки |
-- | Ревизор                        |
-- +--------------------------------+
-- 17 rows in set (0.0005 sec)


select 0, "просто столбец", title from books;

-- +---+----------------+--------------------------------+
-- | 0 | просто столбец | title                          |
-- +---+----------------+--------------------------------+
-- | 0 | просто столбец | Капитанская дочка              |
-- | 0 | просто столбец | Пиковая дама                   |
-- | 0 | просто столбец | Элетрическо тело, пою!         |
-- .......................................................
-- | 0 | просто столбец | Одиссея                        |
-- | 0 | просто столбец | Вечера на хуторе близ Диканьки |
-- | 0 | просто столбец | Ревизор                        |
-- +---+----------------+--------------------------------+
-- 17 rows in set (0.0006 sec)


select id from books;

-- +----+
-- | id |
-- +----+
-- | 10 |
-- |  5 |
-- |  6 |
-- ......
-- |  7 |
-- | 14 |
-- | 15 |
-- +----+
-- 17 rows in set (0.0008 sec)


select id, id, id from books;

-- +----+----+----+
-- | id | id | id |
-- +----+----+----+
-- | 10 | 10 | 10 |
-- |  5 |  5 |  5 |
-- |  6 |  6 |  6 |
-- ................
-- |  7 |  7 |  7 |
-- | 14 | 14 | 14 |
-- | 15 | 15 | 15 |
-- +----+----+----+
-- 17 rows in set (0.0004 sec)


select id, id + 10, id + 20 from books;
-- +----+---------+---------+
-- | id | id + 10 | id + 20 |
-- +----+---------+---------+
-- | 10 |      20 |      30 |
-- |  5 |      15 |      25 |
-- |  6 |      16 |      26 |
-- ..........................
-- |  7 |      17 |      27 |
-- | 14 |      24 |      34 |
-- | 15 |      25 |      35 |
-- +----+---------+---------+
-- 17 rows in set (0.0007 sec)


select
  curtime(6),
  title
from
  books;

-- +-----------------+--------------------------------+
-- | curtime(6)      | title                          |
-- +-----------------+--------------------------------+
-- | 13:27:40.123390 | Капитанская дочка              |
-- | 13:27:40.123390 | Пиковая дама                   |
-- | 13:27:40.123390 | Элетрическо тело, пою!         |
-- | 13:27:40.123390 | Двухсолетний человек           |
-- | 13:27:40.123390 | Бесы                           |
-- | 13:27:40.123390 | Преступление и наказание       |
-- | 13:27:40.123390 | На западном фронте без перемен |
-- | 13:27:40.123390 | Истовик-камень                 |
-- | 13:27:40.123390 | Волкодав                       |
-- | 13:27:40.123390 | Война и мир                    |
-- | 13:27:40.123390 | Барраяр                        |
-- | 13:27:40.123390 | Осколки чести                  |
-- | 13:27:40.123390 | Игры форов                     |
-- | 13:27:40.123390 | Иллиада                        |
-- | 13:27:40.123390 | Одиссея                        |
-- | 13:27:40.123390 | Вечера на хуторе близ Диканьки |
-- | 13:27:40.123390 | Ревизор                        |
-- +-----------------+--------------------------------+
-- 17 rows in set (0.0006 sec)


select concat(curtime(6), " — ", title) from books;

-- +--------------------------------------------------+
-- | concat(curtime(6), " — ", title)                 |
-- +--------------------------------------------------+
-- | 13:31:16.485144 — Капитанская дочка              |
-- | 13:31:16.485144 — Пиковая дама                   |
-- | 13:31:16.485144 — Элетрическо тело, пою!         |
-- | 13:31:16.485144 — Двухсолетний человек           |
-- | 13:31:16.485144 — Бесы                           |
-- | 13:31:16.485144 — Преступление и наказание       |
-- | 13:31:16.485144 — На западном фронте без перемен |
-- | 13:31:16.485144 — Истовик-камень                 |
-- | 13:31:16.485144 — Волкодав                       |
-- | 13:31:16.485144 — Война и мир                    |
-- | 13:31:16.485144 — Барраяр                        |
-- | 13:31:16.485144 — Осколки чести                  |
-- | 13:31:16.485144 — Игры форов                     |
-- | 13:31:16.485144 — Иллиада                        |
-- | 13:31:16.485144 — Одиссея                        |
-- | 13:31:16.485144 — Вечера на хуторе близ Диканьки |
-- | 13:31:16.485144 — Ревизор                        |
-- +--------------------------------------------------+
-- 17 rows in set (0.0005 sec)

