select * from books where author_id = 4;

-- +----+-----------+---------------+
-- | id | author_id | title         |
-- +----+-----------+---------------+
-- | 11 |         4 | Барраяр       |
-- | 12 |         4 | Осколки чести |
-- | 13 |         4 | Игры форов    |
-- +----+-----------+---------------+
-- 3 rows in set (0.0003 sec)


  select author_id, 
         title 
    from books 
order by author_id, 
         title;

-- +-----------+--------------------------------+
-- | author_id | title                          |
-- +-----------+--------------------------------+
-- |         1 | Война и мир                    |
-- |         2 | Бесы                           |
-- |         2 | Преступление и наказание       |
-- ..............................................
-- |         8 | На западном фронте без перемен |
-- |        10 | Иллиада                        |
-- |        10 | Одиссея                        |
-- +-----------+--------------------------------+
-- 17 rows in set (0.0019 sec)

