poem = '''У лукоморья дуб зеленый,
Златая цепь на дубе том:
И днем и ночью кот ученый
Всё ходит по цепи кругом;
Идет направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных;
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несет богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идет, бредет сама собой;
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мед я пил;
У моря видел дуб зеленый;
Под ним сидел, и кот ученый
Свои мне сказки говорил.
Одну я помню: сказку эту
Поведаю теперь я свету…'''

punctuation = '.,:;!?-–—…'

words_raw = poem.split()
words_clear = []

for word in words_raw:
    word = word.rstrip(punctuation)
    if word:
        words_clear.append(word.lower())

