fruit_colors = {
    'яблоко': 'зелёный',
    'банан': 'жёлтый',
    'апельсин': 'оранжевый',
    'слива': 'красный',
    'груша': 'зелёный',
}

# >>> fruit_colors
# {'яблоко': 'зелёный', 'банан': 'жёлтый', 'апельсин': 'оранжевый', 'слива': 'красный', 'груша': 'зелёный'}

char_codes = dict(
    a=ord('a'),
    b=ord('b'),
    c=ord('c'),
    d=ord('d'),
    e=ord('e'),
    f=ord('f'),
)

# >>> char_codes
# {'a': 97, 'b': 98, 'c': 99, 'd': 100, 'e': 101, 'f': 102}

numbers_evenity = dict([
    (1, 'простое'),
    (2, 'не простое'),
    (3, 'простое'),
    (4, 'не простое'),
    (5, 'простое'),
    (6, 'не простое'),
])

# >>> numbers_evenity
# {1: 'простое', 2: 'не простое', 3: 'простое', 4: 'не простое', 5: 'простое', 6: 'не простое'}

menu = dict(zip(
    ['борщ', 'солянка', 'том-ям'], 
    (150, 135, 180)
))

# >>> menu
# {'борщ': 150, 'солянка': 135, 'том-ям': 180}

tens = dict.fromkeys(range(10, 100, 10))

# >>> tens
# {10: None, 20: None, 30: None, 40: None, 50: None, 60: None, 70: None, 80: None, 90: None}

cyr_letters = dict.fromkeys('абвгдеёжзийклмнопрстуфхцчшщьыъэюя', 0)

# >>> cyr_letters
# {'а': 0, 'б': 0, 'в': 0, 'г': 0, 'д': 0, 'е': 0, 'ё': 0, 'ж': 0, 'з': 0, 'и': 0, 'й': 0, 'к': 0, 'л': 0, 'м': 0, 'н': 0, 'о': 0, 'п': 0, 'р': 0, 'с': 0, 'т': 0, 'у': 0, 'ф': 0, 'х': 0, 'ц': 0, 'ч': 0, 'ш': 0, 'щ': 0, 'ь': 0, 'ы': 0, 'ъ': 0, 'э': 0, 'ю': 0, 'я': 0}


office = {
    'Артём': 34,
    'Игнат': 31,
    'Сергей': 39,
    'Алексей': 28,
}
candidates = {
    'Иван': 41,
    'Пётр': 37,
    'Сергей': 27,
}
# >>> office | candidates
# {'Артём': 34, 'Игнат': 31, 'Сергей': 27, 'Алексей': 28, 'Иван': 41, 'Пётр': 37}
# >>>
# >>> office
# {'Артём': 34, 'Игнат': 31, 'Сергей': 39, 'Алексей': 28}
# >>> candidates
# {'Иван': 41, 'Пётр': 37, 'Сергей': 27}

