num1 = int(input('число 1: '))
num2 = int(input('число 2: '))


# избегать таких способов записи проверки на вхождение числа в диапазон
# if num1 < 100 and num1 >= 10:
#     ...
# 
# if 10 <= num1 and num1 < 100:
#     ...

# желательный способ записи проверки на вхождение числа в диапазон
# if 10 <= num1 < 100:
#     ...


if 10 <= num1 < 100 and 10 <= num2 < 100:
    print('двузначные')


if 10 <= num1 < 100:
    if 10 <= num2 < 100:
        print('двузначные')


if len(str(num1)) == 2 and len(str(num2)) == 2:
    print('двузначные')

