# унарный арифметический оператор
# >>> -14
# -14

# бинарные арифметические операторы
# >>> 5 + 7
# 12
# >>> 5 - 7
# -2
# >>> 5 * 7
# 35
# >>> 5 / 7
# 0.7142857142857143
# >>> 5 // 7
# 0
# >>> 13 // 7
# 1
# >>> 15 // 7
# 2
# >>> 5 % 7
# 5
# >>> 13 % 7
# 6
# >>> 15 % 7
# 1
# >>> 2 ** 3
# 8
# >>> 2 ** 11
# 2048

# если один из операндов float объект, то результат тоже float объект
# >>> 5 + 7.0
# 12.0
# >>> 5.0 - 7
# -2.0
# >>> 15 // 7.0
# 2.0
# >>> 13.0 % 7
# 6.0
# >>> 2 ** 5.0
# 32.0


# конкатенация строк
# >>> 'abc' + 'def'
# 'abcdef'
# >>>
# >>> '7' + '5'
# '75'
# >>>
# >>> 'z' * 7
# 'zzzzzzz'
# >>>
# >>> 'abc' * 5
# 'abcabcabcabcabc'
# >>>
# >>> ' | ' * 3
# ' |  |  | '

